20260117123830-numeric_type_conversions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-07 Sat 17:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Numeric Type Conversions</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Numeric Type Conversions</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc45d89e">1. Numeric Type Conversions</a>
<ul>
<li><a href="#org7908f17">1.1. See also:</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgc45d89e" class="outline-2">
<h2 id="orgc45d89e"><span class="section-number-2">1.</span> Numeric Type Conversions</h2>
<div class="outline-text-2" id="text-1">
<p>
<code>Floating-point</code> numbers can be converted into <code>integers</code> using <a href="20260117123959-explicit_casting.html#ID-05d4557c-1aca-4936-8c98-0a285d5eb61d">Explicit Casting</a>.
</p>

<p>
Can you perform binary operations with <b>two</b> <b>operands</b> of <b>different</b> <b>types</b>?
Yes.
</p>

<p>
If an <code>integer</code> and a <code>floating-point</code> number are involved in a binary operation, Java <b>automatically</b> converts the <code>integer</code> to a <code>floating-poin</code> value.
</p>

<p>
Therefore, <code>3 * 4.5</code> is the same as <code>3.0 * 4.5</code>.
</p>

<p>
You can always assign a value to a numeric variable whose type supports a <b>larger</b> range of values; thus, for instance, you can assign a <code>long</code> value to a <code>float</code> variable.
</p>

<p>
You cannot, however, assign a value to a variable of a type with a smaller range unless you use type casting.
</p>

<p>
<a href="20231224190739-widening_primitive_conversion.html#ID-3ef23225-ae37-428e-8ad3-5d7728f59478">Casting</a> is an <b>operation</b> that converts a value of <code>one data type</code> into a value of <code>another data type</code>.
</p>

<p>
<b>small</b> range to larger range = <b>widening a type</b>.
</p>

<p>
<b>large</b> range to smaller range = <b>narrowing</b> <b>a</b> <b>type</b>.
</p>

<p>
Java will <b>automatically</b> <code>widen</code> a type, but you must <code>narrow</code> a type <b>explicitly</b>.
</p>

<p>
The syntax for casting a type is to specify the target type in parentheses, followed by the variable’s name or the value to be cast.
<code>System.out.println((int)1.7);</code>
</p>

<p>
When a <code>double</code> value is <b>cast</b> into an <code>int</code> value, the fractional part is <b>truncated</b>.
The following statement <code>System.out.println((double)1 / 2);</code> displays <code>0.5</code>, because <code>1</code> is <b>cast</b> to <code>1.0</code> first, then <code>1.0</code> is divided by <code>2</code>.
</p>

<p>
However, the statement <code>System.out.println(1 / 2);</code> displays <code>0</code>, because <code>1</code> and <code>2</code> are both <b>integers</b> and the resulting value should also be an <b>integer</b>.
</p>
</div>


<div id="outline-container-org7908f17" class="outline-3">
<h3 id="org7908f17"><span class="section-number-3">1.1.</span> See also:</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><a href="20260117123959-explicit_casting.html#ID-05d4557c-1aca-4936-8c98-0a285d5eb61d">Explicit Casting</a></li>
<li><a href="Casting.md.html#ID-7a913830-843c-4872-9365-e5f2f59808a9">Implicit Casting</a></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
